In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series(np.arange(2),index=['A','B'])

In [3]:
s

A    0
B    1
dtype: int32

In [4]:
s2=pd.Series(np.arange(2,5),index=['A','B','C'])

In [5]:
s2

A    2
B    3
C    4
dtype: int32

In [6]:
s +s2

A    2.0
B    4.0
C    NaN
dtype: float64

In [10]:
s.add(s2)

A    2.0
B    4.0
C    NaN
dtype: float64

In [14]:
df=pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('ABC'),index=['india','usa','uk'])

In [15]:
df

       A  B  C
india  0  1  2
usa    3  4  5
uk     6  7  8

In [17]:
df2=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('ACD'),index=['india','usa','uk','france'])

In [22]:
df2

        A   C   D
india   0   1   2
usa     3   4   5
uk      6   7   8
france  9  10  11

In [19]:
df+df2

           A   B     C   D
france   NaN NaN   NaN NaN
india    0.0 NaN   3.0 NaN
uk      12.0 NaN  15.0 NaN
usa      6.0 NaN   9.0 NaN

In [23]:
df.add(df2,fill_value=0)

           A    B     C     D
france   9.0  NaN  10.0  11.0
india    0.0  1.0   3.0   2.0
uk      12.0  7.0  15.0   8.0
usa      6.0  4.0   9.0   5.0